# Задача №21. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально.
# Пользователь его не вводит
n = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
     {"VII": " S005 "}, {" V ": " S009 "}, {" VIII ": " S007 "}]
res = []
for i in n:     # Берем словарь в списке
    for (k, v) in i.items():    # Получаем значение в словаре не зная ключа
        res.append(' '.join(v.split()))     # Удаляем пробелы и заносим значение в список
print(set(res))     # Выводим уникальные значения в списке
